Vadim139/ARM/STM32F407/LineFollower/src/main.cpp
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	/* Connect TIM3 pins to AF */
	GPIO_PinAFConfig(GPIOC, GPIO_PinSource6, GPIO_AF_TIM3);
	TIM_TimeBaseStructure.TIM_Period = 65535;
	TIM_TimeBaseStructure.TIM_Prescaler = 0;
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);
	TIM_TIxExternalClockConfig(TIM3, TIM_TIxExternalCLK1Source_TI1,
	TIM_ICPolarity_Falling, 15);
	TIM_Cmd(TIM3, ENABLE);
}

void TIM5_INT_Init() {
	// Enable clock for TIM2
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);

	// (Hz) = 84MHz / ((839 + 1) * (9999 + 1)) = 10 Hz
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
	TIM_TimeBaseInitStruct.TIM_Prescaler = 9999;
	TIM_TimeBaseInitStruct.TIM_Period = 839;
	TIM_TimeBaseInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStruct.TIM_CounterMode = TIM_CounterMode_Up;

	// TIM2 initialize
	TIM_TimeBaseInit(TIM5, &TIM_TimeBaseInitStruct);
	// Enable TIM2 interrupt
	TIM_ITConfig(TIM5, TIM_IT_Update, ENABLE);
	// Start TIM2
	TIM_Cmd(TIM5, ENABLE);

	NVIC_InitTypeDef NVIC_InitStruct;
	NVIC_InitStruct.NVIC_IRQChannel = TIM5_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStruct);
}

void EXTI_Conf() {
	GPIO_InitTypeDef GPIO_InitStruct;
	EXTI_InitTypeDef EXTI_InitStruct;
	NVIC_InitTypeDef NVIC_InitStruct;

	/* Enable clock for GPIOD */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
	/* Enable clock for SYSCFG */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

	/* Set pin as input */
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_DOWN;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_Init(GPIOA, &GPIO_InitStruct);

	/* Tell system that you will use PD0 for EXTI_Line0 */
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA, EXTI_PinSource0);

	/* PD0 is connected to EXTI_Line0 */
	EXTI_InitStruct.EXTI_Line = EXTI_Line0;
	/* Enable interrupt */
	EXTI_InitStruct.EXTI_LineCmd = ENABLE;
	/* Interrupt mode */
	EXTI_InitStruct.EXTI_Mode = EXTI_Mode_Interrupt;
	/* Triggers on rising and falling edge */
	EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
	/* Add to EXTI */
	EXTI_Init(&EXTI_InitStruct);

	/* Add IRQ vector to NVIC */
	/* PD0 is connected to EXTI_Line0, which has EXTI0_IRQn vector */
	NVIC_InitStruct.NVIC_IRQChannel = EXTI0_IRQn;
	/* Set priority */
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0x00;
	/* Set sub priority */
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0x00;
	/* Enable interrupt */
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	/* Add to NVIC */
	NVIC_Init(&NVIC_InitStruct);
}
volatile u16 RPM_L = 0;
volatile u16 RPM_P = 0;

int main(void) {

	/* Initialization */

	RCC_HSEConfig(RCC_HSE_ON);
	while (!RCC_WaitForHSEStartUp()) {
	}

//
//  Init_SysTick();
//  SysTick_Config(168);

	trace_printf("Timer initialization...");
	Timer timer;
	timer.start();
	trace_printf(" Succeed\n");

	ADC_DMA_config();

	LCD5110_init();

	TIM2_Configuration();
	TIM3_Configuration();
	TIM5_INT_Init();

	EXTI_Conf();
//	LCD5110_write_string("1234567890");

	Engine::Init(2);
//	Eng_left.Set_speed(20);
//	Eng_right.Set_speed(20);

//    EXTI_Config(GPIOA,GPIO_Pin_0,EXTI_Trigger_Rising);
	uint32_t CaptureNumber = 0;
	uint32_t counter = 0;
	uint32_t Time = 0;
	uint32_t freq = 0;

	uint16_t ADC_1 = 0;
	char ADCs1[5] = { 0, 0, 0, 0, 0 };
	uint16_t ADC_2 = 0;
	char ADCs2[5] = { 0, 0, 0, 0, 0 };
	uint16_t ADC_3 = 0;
	char ADCs3[5] = { 0, 0, 0, 0, 0 };
	uint16_t ADC_4 = 0;
	char ADCs4[5] = { 0, 0, 0, 0, 0 };

//	Sensor LZ(3900,3650,3570,3555,ADC1,TM_ADC_Channel_10);
//	Sensor LS(3630,3000,3110,2860,ADC1,TM_ADC_Channel_11);
//	Sensor PS(3900,3500,3560,3400,ADC1,TM_ADC_Channel_12);
//	Sensor PZ(3480,2930,3000,2865,ADC1,TM_ADC_Channel_13);

//	Sensor LZ(3900,3650,3580,3630,ADC1,TM_ADC_Channel_10);
//	Sensor LS(3890,2990,2930,3058,ADC1,TM_ADC_Channel_11);
//	Sensor PS(4050,3505,3475,3520,ADC1,TM_ADC_Channel_12);
//	Sensor PZ(3580,3090,2940,3110,ADC1,TM_ADC_Channel_13);

//	Sensor LZ(3790,2250,2200,1900,ADC1,TM_ADC_Channel_10);
//	Sensor LS(3750,300,400,50,ADC1,TM_ADC_Channel_11);
//	Sensor PS(4060,2000,2220,1500,ADC1,TM_ADC_Channel_12);
//	Sensor PZ(3400,1500,1205,600,ADC1,TM_ADC_Channel_13);

//	Sensor LZ(4000, 3400, 3200, 3150, ADC1, TM_ADC_Channel_10, &ADCConvertedValues[0]);
//	Sensor LS(3800, 1850, 1750, 1150, ADC1, TM_ADC_Channel_11, &ADCConvertedValues[1]);
//	Sensor PS(4000, 3100, 2900, 2550, ADC1, TM_ADC_Channel_12, &ADCConvertedValues[2]);
//	Sensor PZ(3500, 1900, 1800, 1350, ADC1, TM_ADC_Channel_13, &ADCConvertedValues[3]);

//	Sensor LZ(3700, 3400, 3200, 3150, ADC1, TM_ADC_Channel_10, &ADCConvertedValues[0]);
//	Sensor LS(3700, 1850, 1750, 1150, ADC1, TM_ADC_Channel_11, &ADCConvertedValues[1]);
//	Sensor PS(4000, 3100, 2900, 2550, ADC1, TM_ADC_Channel_12, &ADCConvertedValues[2]);
//	Sensor PZ(3300, 1900, 1800, 1350, ADC1, TM_ADC_Channel_13, &ADCConvertedValues[3]);

//	Sensor LZ(3750, 3050, 3120, 2980, ADC1, TM_ADC_Channel_10, &ADCConvertedValues[0]);
//	Sensor LS(3600, 1150, 1180, 480 , ADC1, TM_ADC_Channel_11, &ADCConvertedValues[1]);
//	Sensor PS(3880, 2400, 2450, 1980, ADC1, TM_ADC_Channel_12, &ADCConvertedValues[2]);
//	Sensor PZ(3400, 2330, 2280, 2000, ADC1, TM_ADC_Channel_13, &ADCConvertedValues[3]);

//	Sensor LZ(3870, 2890, 2880, 2600, ADC1, TM_ADC_Channel_10, &ADCConvertedValues[0]);
//	Sensor LS(3750, 2300, 2360, 2100 , ADC1, TM_ADC_Channel_11, &ADCConvertedValues[1]);
//	Sensor PS(3950, 3100, 3150, 3000, ADC1, TM_ADC_Channel_12, &ADCConvertedValues[2]);
//	Sensor PZ(3870, 3120, 3170, 3000, ADC1, TM_ADC_Channel_13, &ADCConvertedValues[3]);

//	Sensor LZ(3750, 2350, 2330, 1940, ADC1, TM_ADC_Channel_10, &ADCConvertedValues[0]);
//	Sensor LS(3520, 1340, 1220, 780 , ADC1, TM_ADC_Channel_11, &ADCConvertedValues[1]);
//	Sensor PS(3850, 2530, 2450, 2200, ADC1, TM_ADC_Channel_12, &ADCConvertedValues[2]);
//	Sensor PZ(3750, 2760, 2670, 2350, ADC1, TM_ADC_Channel_13, &ADCConvertedValues[3]);

	Sensor SS(3550, 2260, 2300, 2040, ADC1, 0, ADCConvertedValues);
	Sensor LZ(3720, 2260, 2300, 1880, ADC1, 1, ADCConvertedValues);
	Sensor LS(3610, 2100, 2260, 1910, ADC1, 2, ADCConvertedValues);
	Sensor PS(3820, 2240, 2440, 2130, ADC1, 3, ADCConvertedValues);
	Sensor PZ(3550, 1450, 1290, 1060, ADC1, 4, ADCConvertedValues);

	uint8_t Last_inner = 0, Last_outer = 0;
	uint8_t color = BLACK;
	u8 lz, ls,ss,ps,pz;
//	lz = LZ.Get_color2();
	ls = LS.Get_color2();
	ss = SS.Get_color2();
	ps = PS.Get_color2();
//	pz = PZ.Get_color2();

	while (1) {
		if (Flag)  {

			switch (color) {
				case BLACK:
//					if(lz == BLUE || ls == BLUE || ps == BLUE || ss == BLUE || pz == BLUE)
//					{
//						if(timer.TO_flag){
//							color = BLUE;
//							timer.set_TimeOut(1000);
//							break;
//						}
//					}
					if (LZ.Get_color() == BLACK && LS.Get_color() != BLACK && PS.Get_color() != BLACK && SS.Get_color() != BLACK) {
						if (Last_outer == 0) {

							Last_inner = LEFT;
							Engine::Turn(LEFT, GENTLE_TWO, &Eng_left, &Eng_right);
		//					LCD5110_set_XY(0, 3);
		//					LCD5110_write_Dec(1);

