Vadim139/ARM/STM32F407/LineFollower/src/main.cpp
						}

					} else if (LZ.Get_color() == BLACK && (LS.Get_color() == BLACK || PS.Get_color() == BLACK || SS.Get_color() == BLACK)) {
						if (Last_outer == 0) { //Last_outer!=RIGHT_S   || Last_outer == RIGHT_S
							Last_outer = LEFT_S;
							Last_inner = LEFT_S;
							Engine::Turn(LEFT, GENTLE_ONE, &Eng_left, &Eng_right);
							timer.sleep(500);
		//					LCD5110_set_XY(0, 3);
		//					LCD5110_write_Dec(2);

						}

					} else if (PZ.Get_color() == BLACK && LS.Get_color() != BLACK && PS.Get_color() != BLACK && SS.Get_color() != BLACK) {
						if (Last_outer == 0) {

							Last_inner = RIGHT_S;
							Engine::Turn(RIGHT, GENTLE_TWO, &Eng_left, &Eng_right);
		//					LCD5110_set_XY(0, 3);
		//					LCD5110_write_Dec(3);
						}

					} else if (PZ.Get_color() == BLACK && (LS.Get_color() == BLACK || PS.Get_color() == BLACK || SS.Get_color() == BLACK)) {
						if (Last_outer == 0) { //Last_outer!=RIGHT_S   || Last_outer == RIGHT_S
							Last_outer = RIGHT;
							Last_inner = RIGHT;
							Engine::Turn(RIGHT, GENTLE_ONE, &Eng_left, &Eng_right);
							timer.sleep(500);
		//					LCD5110_set_XY(0, 3);
		//					LCD5110_write_Dec(4);

						}

					} else if (SS.Get_color() == BLACK && LS.Get_color() != BLACK && PS.Get_color() != BLACK) {
						if (Last_inner < 3 && (Last_outer < 1 || Last_outer > 2)) {

							Eng_left.Set_speed(3);
							Eng_right.Set_speed(10);

						}

					} else if (LS.Get_color() == BLACK && PS.Get_color() != BLACK && SS.Get_color() != BLACK) {
						if (Last_inner < 3) { // && (Last_outer < 1 || Last_outer > 2 )
							Last_inner = LEFT_S;
							Engine::Turn(LEFT, GENTLE_ONE, &Eng_left, &Eng_right);
							if (Last_outer > 0)
								Last_outer = NONE;
						}
					} else if (LS.Get_color() != BLACK && PS.Get_color() == BLACK && SS.Get_color() != BLACK) {
						if (Last_inner < 3) { // && (Last_outer < 1 || Last_outer > 2 )
							Last_inner = RIGHT_S;
							Engine::Turn(RIGHT, GENTLE_ONE, &Eng_left, &Eng_right);
							if (Last_outer > 0)
								Last_outer = NONE;
						}
					} else if (LS.Get_color() != BLACK && PS.Get_color() != BLACK && SS.Get_color() != BLACK) {
						if (Last_outer == 0) {
							if (Last_inner == LEFT_S)
								Engine::Turn(LEFT, GENTLE_TWO, &Eng_left, &Eng_right);
							if (Last_inner == RIGHT_S)
								Engine::Turn(RIGHT, GENTLE_TWO, &Eng_left, &Eng_right);
						}
					}
					break;
				case BLUE:
//					lz = LZ.Get_color2();
					ls = LS.Get_color2();
					ss = SS.Get_color2();
					ps = PS.Get_color2();
//					pz = PZ.Get_color2();
//					if(LZ.Get_color() == BLACK || LS.Get_color() == BLACK || PS.Get_color() == BLACK || SS.Get_color() == BLACK || PZ.Get_color() == BLACK)
//					{
//						if(timer.TO_flag){
//							color = BLACK;
//							timer.set_TimeOut(1000);
//							break;
//						}
//					}

//					if (lz == BLUE && ls != BLUE && ps != BLUE && ss != BLUE) {
//						if (Last_outer == 0) {
//
//							Last_inner = LEFT;
//							Engine::Turn(LEFT, GENTLE_TWO, &Eng_left, &Eng_right);
//		//					LCD5110_set_XY(0, 3);
//		//					LCD5110_write_Dec(1);
//
//						}
//
//					} else if (lz == BLUE && (ls == BLUE || ps == BLUE || ss == BLUE)) {
//						if (Last_outer == 0) { //Last_outer!=RIGHT_S   || Last_outer == RIGHT_S
//							Last_outer = LEFT_S;
//							Last_inner = LEFT_S;
//							Engine::Turn(LEFT, GENTLE_ONE, &Eng_left, &Eng_right);
//							timer.sleep(500);
//		//					LCD5110_set_XY(0, 3);
//		//					LCD5110_write_Dec(2);
//
//						}
//
//					} else if (pz == BLUE && ls != BLUE && ps != BLUE && ss != BLUE) {
//						if (Last_outer == 0) {
//
//							Last_inner = RIGHT_S;
//							Engine::Turn(RIGHT, GENTLE_TWO, &Eng_left, &Eng_right);
//		//					LCD5110_set_XY(0, 3);
//		//					LCD5110_write_Dec(3);
//						}
//
//					} else if (pz == BLUE && (ls == BLUE || ps == BLUE || ss == BLUE)) {
//						if (Last_outer == 0) { //Last_outer!=RIGHT_S   || Last_outer == RIGHT_S
//							Last_outer = RIGHT;
//							Last_inner = RIGHT;
//							Engine::Turn(RIGHT, GENTLE_ONE, &Eng_left, &Eng_right);
//							timer.sleep(500);
//		//					LCD5110_set_XY(0, 3);
//		//					LCD5110_write_Dec(4);
//
//						}

//					} else
					if (ss == BLUE && ls != BLUE && ps != BLUE) {
						if (Last_inner < 3 && (Last_outer < 1 || Last_outer > 2)) {

							Eng_left.Set_speed(3);
							Eng_right.Set_speed(10);

						}

					} else if (ls == BLUE && ps != BLUE && ss != BLUE) {
						if (Last_inner < 3) { // && (Last_outer < 1 || Last_outer > 2 )
							Last_inner = LEFT_S;
							Engine::Turn(LEFT, GENTLE_ONE, &Eng_left, &Eng_right);
							if (Last_outer > 0)
								Last_outer = NONE;
						}
					} else if (ls != BLUE && ps == BLUE && ss != BLUE) {
						if (Last_inner < 3) { // && (Last_outer < 1 || Last_outer > 2 )
							Last_inner = RIGHT_S;
							Engine::Turn(RIGHT, GENTLE_ONE, &Eng_left, &Eng_right);
							if (Last_outer > 0)
								Last_outer = NONE;
						}
					} else if (ls != BLUE && ps != BLUE && ss != BLUE) {
						if (Last_outer == 0) {
							if (Last_inner == LEFT_S)
								Engine::Turn(LEFT, GENTLE_TWO, &Eng_left, &Eng_right);
							if (Last_inner == RIGHT_S)
								Engine::Turn(RIGHT, GENTLE_TWO, &Eng_left, &Eng_right);
						}
					}
					break;
				default:
					break;
			}


		}
//		LCD5110_set_XY(0, 0);
//		sprintf(temp, "     SS:%d       LS:%d  PS:%d  LZ:%d      PZ:%d", SS.Get_color(),
//				LS.Get_color(), PS.Get_color(), LZ.Get_color(), PZ.Get_color());
//		LCD5110_write_string(temp);
////		LCD5110_set_XY(0,3);
////		LCD5110_write_Dec(TIM_GetCounter(TIM2));
////		LCD5110_set_XY(5,3);
////		LCD5110_write_Dec(TIM_GetCounter(TIM3));
//		LCD5110_set_XY(0, 3);
//		LCD5110_write_Dec(Last_inner);
//		LCD5110_set_XY(5, 3);
//		LCD5110_write_Dec(Last_outer);

//		trace_printf("LZ: %d   LS: %d   SS: %d  PS: %d   PZ: %d   \n", (uint16_t)(ADCConvertedValues[1]*1.01),
//				(uint16_t)(ADCConvertedValues[2]*1.052), (uint16_t)(ADCConvertedValues[0]), (uint16_t)(ADCConvertedValues[3]*0.948), (uint16_t)(ADCConvertedValues[4]*1.5));

//		trace_printf("LZ: %d   LS: %d   SS: %d  PS: %d   PZ: %d   \n", ADCConvertedValues[1],
//						ADCConvertedValues[2], ADCConvertedValues[0], ADCConvertedValues[3], ADCConvertedValues[4]);

