Vadim139/ARM/STM32F407/LineFollower/src/main.cpp
//		trace_printf("Counter: %d\n",TIM_GetCounter(TIM3));
//		timer.sleep(1000);
//		ls = LS.Get_color2();
//		ss = SS.Get_color2();
//		ps = PS.Get_color2();
//		trace_printf("LZ: %d   LS: %d   SS: %d  PS: %d   PZ: %d   \n", lz,
//				ls, ss, ps, pz);
//		trace_printf("LZ: %d   LS: %d   SS: %d  PS: %d   PZ: %d   \n", LZ.Get_color(),
//				LS.Get_color(), SS.Get_color(), PS.Get_color(), PZ.Get_color());
//		trace_printf("LZ: %d   LS: %d   PS: %d   PZ: %d   \n", ADCConvertedValues[0],
//				ADCConvertedValues[1], ADCConvertedValues[2], ADCConvertedValues[3]);
//    	ADC_1 = TM_ADC_Read(ADC1,TM_ADC_Channel_10);
//    	ADC_1 = ADC_GetConversionValue(ADC2);
//    	uint16tostr(ADCs1, ADC_1, 10);
////    	trace_printf("ADC1: %s\n",ADCs1);
////    	puts(ADCs1);
//
//    	ADC_2 = TM_ADC_Read(ADC1,TM_ADC_Channel_11);
//    	uint16tostr(ADCs2, ADC_2, 10);
////    	trace_printf("ADC2: %s\n",ADCs2);
//
//    	ADC_3 = TM_ADC_Read(ADC1,TM_ADC_Channel_12);
//    	uint16tostr(ADCs3, ADC_3, 10);
////    	trace_printf("ADC3: %s\n",ADCs3);
//
////    	ADC_4 = TM_ADC_Read(ADC1,TM_ADC_Channel_13);
//    	ADC_4 = ADC_GetConversionValue(ADC3);
//    	uint16tostr(ADCs4, ADC_4, 10);
////    	trace_printf("ADC4: %s\n",ADCs4);
//    	trace_printf("ADC2: %d\n",ADCConvertedValues[0]);
//    	trace_printf("LZ: %d   LS: %d   PS: %d   PZ: %d   \n",ADCConvertedValues[0],ADCConvertedValues[1],ADCConvertedValues[2],ADCConvertedValues[3]);
//    	trace_printf("ADC1: %s   ADC2: %s   ADC3: %s   ADC4: %s   \n",ADCs1,ADCs2,ADCs3,ADCs4);
//		trace_printf("LZ: %d   LS: %d   PS: %d   PZ: %d   \n", LZ.Get_color(),
//				LS.Get_color(), PS.Get_color(), PZ.Get_color());
//    	if(LZ.Get_color() == BLACK)
//    	{
//    	    TIM_SetCompare1(TIM4, 0);
//    	    TIM_SetCompare2(TIM4, 0);
//    	}
//    	if(LS.Get_color() == BLUE)
//    	{
//    	    TIM_SetCompare1(TIM4, 0);
//    	    TIM_SetCompare2(TIM4, 0);
//    	}
//    	if(PS.Get_color() == BLUE)
//    	{
//    	    TIM_SetCompare1(TIM4, 0);
//    	    TIM_SetCompare2(TIM4, 0);
//    	}
//    	if(PZ.Get_color() == BLACK)
//    	{
//    	    TIM_SetCompare1(TIM4, 0);
//    	    TIM_SetCompare2(TIM4, 0);
//    	}

//		timer.sleep(500);

	}

}
volatile u16 sec = 0;
void TIM5_IRQHandler(void) {
	if (TIM_GetITStatus(TIM5, TIM_IT_Update) != RESET) {
		TIM_ClearITPendingBit(TIM5, TIM_IT_Update);

		RPM_L = TIM_GetCounter(TIM2) * 30;
		RPM_P = TIM_GetCounter(TIM3) * 30;

		TIM_SetCounter(TIM2, 0);
		TIM_SetCounter(TIM3, 0);
//		sec++;
//		trace_printf("Sec: %d",sec);
	}
}
volatile u8 f = 0;
void EXTI0_IRQHandler(void) {
	if (EXTI_GetITStatus(EXTI_Line0) != RESET) {
//	  puts("hi");
		delay_ms(1000);
//		if((((GPIOA)->IDR & (GPIO_Pin_0)) == 0 ? 0 : 1))
//		{
		LCD5110_set_XY(0, 5);
		LCD5110_write_string("START");
		delay_ms(5000);
		Eng_left.Set_speed(5);
		Eng_right.Set_speed(40);
		Flag = true;

//		}else
//		{
//			switch (f) {
//			case 0:
//				Eng_left.Set_speed(-50);
//				Eng_right.Set_speed(-50);
//				f++;
//				break;
//			case 1:
//				Eng_left.Set_speed(-20);
//				Eng_right.Set_speed(0xFF);
//				f++;
//				break;
//			case 2:
//				Eng_left.Set_speed(0xFF);
//				Eng_right.Set_speed(-20);
//				f++;
//				break;
//			case 3:
//				Eng_left.Set_speed(5);
//				Eng_right.Set_speed(5);
//				f++;
//				break;
//			case 4:
//				Eng_left.Set_speed(50);
//				Eng_right.Set_speed(50);
//				f++;
//				break;
//			case 5:
//				Eng_left.Set_speed(100);
//				Eng_right.Set_speed(100);
//				f++;
//				break;
//			case 6:
//				Eng_left.Set_speed(0xFF);
//				Eng_right.Set_speed(0xFF);
//				f = 0;
//				break;
//			default:
//				break;
//			}
//		}
//		Eng_left.Set_speed(70);
//		Eng_right.Set_speed(70);
//		delay_ms(10);
//		Eng_left.Set_speed(5);
//		Eng_right.Set_speed(5);
//		Flag = true;

		/* Clear the EXTI line 0 pending bit */
		EXTI_ClearITPendingBit(EXTI_Line0);
	}
}

#ifdef  USE_FULL_ASSERT

/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
	/* User can add his own implementation to report the file name and line number,
	 ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

	while (1)
	{}
}
#endif

/**
 * @}
 */

/**
 * @}
 */

///******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
